-- 1． 列出至少有一个员工的所有部门。 

-- 2． 列出薪金比“小龙女”多的所有员工。 

-- 3． 列出所有员工的姓名及其直接上级的姓名。 

-- 4． 列出受雇日期早于其直接上级的所有员工。

-- 5． 列出部门名称和这些部门的员工信息，同时列出那些没有员工的部门。 

-- 6． 列出所有“开发”的姓名及其部门名称。

-- 7． 列出最低薪金大于1500的各种工作。

-- 8． 列出在部门“销售部”工作的员工的姓名，假定不知道销售部的部门编号

-- 9． 列出薪金高于公司平均薪金的所有员工。

-- 10．列出与“小龙女”从事相同工作的所有员工。 

-- 11．列出薪金等于人力资源部门（30）中员工的薪金的所有员工的姓名和薪金。 

-- 12．列出薪金高于在人力资源部门（30）工作的所有员工的薪金的员工姓名和薪金。 

-- 13．列出在每个部门工作的员工数量、平均工资。 

-- 14．列出所有员工的姓名、部门名称和工资。

-- 15．列出所有部门的详细信息和部门人数。 

-- 16．列出各种工作的最低工资。 

-- 17．列出各个部门的经理的薪金。 

-- 18．列出所有员工的年工资,按年薪从低到高排序。

-- 19. 列出每个部门的最高工资和最低工资，用 ~ 拼接 (提示：CONCAT())

-- 20. 列出员工编号和上级编号，用 - 拼接 (注意：NULL的值要用空格代替，提示：IFNULL(,))